package BasicExercises.Interface;

public class Interface {

    public static void main(String[] args) {

        /*
        Упражнения по интерфейсу Java

        1. Напишите программу на Java для создания формы интерфейса с помощью метода getArea(). Создайте три
        класса Rectangle, Circle и Triangle, реализующие интерфейс Shape. Реализуйте метод getArea() для каждого
        из трех классов.

        2. Напишите программу на Java для создания интерфейса Animal с методом bark(), который не принимает
        аргументов и возвращает void. Создайте класс Dog, который реализует Animal и переопределяет функцию talk()
        для печати «Собака лает».

        3. Напишите программу на Java для создания интерфейса Flyable с помощью метода Fly_obj(). Создайте три класса
        Spacecraft, Airplane и Helicopter, реализующие интерфейс Flyable. Реализуйте метод Fly_obj() для каждого
        из трех классов.

        4. Напишите программу на Java для создания банковской системы с тремя классами — Bank, Account,
        SavingsAccount и CurrentAccount. В банке должен быть список счетов и способы их добавления. Счета должны
        представлять собой интерфейс с методами пополнения, снятия средств, расчета процентов и просмотра баланса.
        SavingsAccount и CurrentAccount должны реализовывать интерфейс Account и иметь свои собственные уникальные
        методы.

        5. Напишите программу Java для создания интерфейса Resizable с методами resizeWidth(int width) и
        resizeHeight(int height), которые позволяют изменять размер объекта. Создайте класс Rectangle, который
        реализует интерфейс Resizable и методы изменения размера.

        6. Напишите программу на Java для создания интерфейса Drawable с методом draw(), который не принимает
        аргументов и возвращает void. Создайте три класса Circle, Rectangle и Triangle, реализующие интерфейс Drawable,
        и переопределите метод draw() для рисования соответствующих фигур.

        7. Напишите программу на Java для создания интерфейса Sortable с методом sort(), который сортирует массив
        целых чисел в порядке возрастания. Создайте два класса BubbleSort и SelectionSort, которые реализуют интерфейс
        Sortable и предоставляют свои собственные реализации метода sort().

        8. Напишите программу на Java для создания интерфейса Playable с методом play(), который не принимает
        аргументов и возвращает void. Создайте три класса Football, Volleyball и Basketball, реализующие интерфейс
        Playable, и переопределите метод play() для занятий соответствующими видами спорта.

        9. Напишите программу на Java для создания интерфейса с возможностью поиска с помощью метода search
        (ключевое слово String), который ищет заданное ключевое слово в текстовом документе. Создайте два класса
        Document и WebPage, которые реализуют интерфейс Searchable и предоставляют собственные реализации
        метода search().

        10. Напишите программу Java для создания интерфейса Encryptable с методами encrypt (строковые данные) и
        расшифровки (строковые зашифрованные данные), которые определяют операции шифрования и дешифрования. Создайте
        два класса AES и RSA, которые реализуют интерфейс Encryptable и предоставляют собственные алгоритмы
        шифрования и дешифрования.

        11. Напишите программу на Java для создания интерфейса Sortable с методом sort (массив int[]), который
        сортирует массив целых чисел в порядке убывания. Создайте два класса QuickSort и MergeSort, которые реализуют
        интерфейс Sortable и предоставляют свои собственные реализации метода sort().
         */
    }
}
