package BasicExercises.Object_Oriented_Programming;

public class Object_Oriented_Programming {

    public static void main(String[] args) {

        /*
        Упражнения по объектно-ориентированному программированию на Java

        1. Напишите программу на Java для создания класса с именем «Person» с атрибутами имени и возраста. Создайте
        два экземпляра класса "Person", задайте их атрибуты с помощью конструктора и напечатайте их имя и возраст.

        2. Напишите программу на Java для создания класса «Собака» с именем и атрибутом породы. Создайте два
        экземпляра класса «Собака», задайте их атрибуты с помощью конструктора и измените атрибуты с помощью методов
        установки и распечатайте обновленные значения.

        3. Напишите программу на Java для создания класса «Прямоугольник» с атрибутами ширины и высоты.
        Вычислите площадь и периметр прямоугольника.

        4. Напишите программу на Java для создания класса под названием «Круг» с атрибутом радиуса. Вы можете
        получить доступ и изменить этот атрибут. Вычислите площадь и длину окружности.

        5. Напишите программу на Java для создания класса «Книга» с атрибутами для названия, автора и ISBN, а также
        методами для добавления и удаления книг из коллекции.

        6. Напишите программу на Java для создания класса «Сотрудник» с именем, названием должности и атрибутами
        зарплаты, а также методами для расчета и обновления зарплаты.

        7. Напишите программу на Java для создания класса под названием «Банк» с набором учетных записей и методов
        для добавления и удаления учетных записей, а также для внесения и снятия денег. Также определите класс
        под названием «Учетная запись» для хранения сведений об учетной записи конкретного клиента.

        8. Напишите программу на Java для создания класса «Светофор» с атрибутами цвета и длительности, а также
        методами для изменения цвета и проверки наличия красного или зеленого цветов.

        9. Напишите программу на Java для создания класса «Сотрудник» с атрибутами имени, зарплаты и даты приема на
        работу, а также методом подсчета лет службы.

        10. Напишите программу на Java для создания класса «Студент» с именем, оценкой и атрибутами курсов, а также
        методами для добавления и удаления курсов.

        11. Напишите программу на Java для создания класса «Библиотека» с набором книг и методов для добавления и
        удаления книг.

        12. Напишите программу на Java для создания класса «Самолет» с номером рейса, пунктом назначения и атрибутами
        времени вылета, а также методами проверки статуса рейса и задержки.

        13. Напишите Java-программу для создания класса Inventory с набором продуктов и методов для добавления и
        удаления продуктов, а также для проверки низкого уровня запасов.

        14. Напишите программу на Java для создания класса «Школа» с атрибутами для учащихся, учителей и классов,
        а также методами для добавления и удаления учеников и учителей, а также для создания классов.

        15. Напишите программу на Java для создания класса MusicLibrary с коллекцией песен и методов для добавления и
        удаления песен, а также для воспроизведения случайной песни.

        16. Напишите программу на Java для создания класса «Форма» с абстрактными методами вычисления площади и
        периметра и подклассов «Прямоугольник», «Окружность» и «Треугольник».

        17. Напишите программу на Java для создания класса «Фильм» с атрибутами для названия, режиссера, актеров и
        рецензий, а также методами для добавления и извлечения рецензий.

        18. Напишите программу на Java для создания класса «Ресторан» с атрибутами для элементов меню, цен и рейтингов,
        а также методов для добавления и удаления элементов и расчета среднего рейтинга.

        19. Напишите программу на Java для создания класса с методами поиска рейсов и отелей, а также бронирования и
        отмены бронирования.
         */
    }
}
