package BasicExercises.Object_Oriented_Programming;

public class Object_Oriented_Programming4 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания класса под названием «Круг» с атрибутом радиуса. Вы можете
        получить доступ и изменить этот атрибут. Вычислите площадь и длину окружности.

        Объяснение:

        В приведенной выше функции main() мы создаем экземпляр класса «Круг» с радиусом 5 и вызываем его методы для
        вычисления площади и окружности. Затем мы изменяем радиус с помощью метода установки и печатаем
        обновленную площадь и окружность.
         */

//        Circle circle1 = new Circle(5);
//        System.out.println("Radius: " + circle1.getRadius());
//        System.out.println("Area of the circle = " + circle1.area());
//        System.out.println("Circumference of the circle = " + circle1.circumference());
//
//        circle1.setRadius(8);
//
//        System.out.println("\nRadius: " + circle1.getRadius());
//        System.out.println("Area of the circle = " + circle1.area());
//        System.out.println("Circumference of the circle = " + circle1.circumference());
    }
}

//class Circle {
//
//    /*
//    Объяснение:
//
//    Вышеупомянутый класс «Круг» имеет частный атрибут «радиус», конструктор, который инициализирует этот атрибут
//    значением, передаваемым в качестве аргумента, а также методы получения и установки для доступа и изменения
//    этого атрибута. Он также вычисляет площадь и окружность круга, используя методы.
//     */
//    double radius;
//
//    public Circle(double radius) {
//        this.radius = radius;
//    }
//
//    public double getRadius() {
//        return radius;
//    }
//
//    public void setRadius(double radius) {
//        this.radius = radius;
//    }
//
//    public double area() {
//
//        return Math.PI * Math.pow(radius, 2);
//    }
//
//    public double circumference() {
//
//        return 2 * Math.PI * radius;
//    }
//}
