package BasicExercises.Object_Oriented_Programming;

public class Object_Oriented_Programming1 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания класса с именем «Person» с атрибутами имени и возраста. Создайте
        два экземпляра класса "Person", задайте их атрибуты с помощью конструктора и напечатайте их имя и возраст.

        Объяснение:

        В приведенном выше примере мы создаем два экземпляра класса «Person», устанавливаем их атрибуты с помощью
        конструктора и печатаем их имя и возраст с помощью методов получения. Мы также изменяем атрибуты с помощью
        методов установки и печатаем обновленные значения.
         */

//        Person person1 = new Person("Evgen", 28);
//        Person person2 = new Person("Lilya", 26);
//
//        System.out.println("Person 1: name " + person1.getName() + " age " + person1.getAge());
//        System.out.println("Person 2: name " + person2.getName() + " age " + person2.getAge());
    }
}

//class Person {
//
//    /*
//    Объяснение:
//
//    Приведенный выше класс имеет два закрытых атрибута: имя и возраст, а также конструктор, который инициализирует эти
//    атрибуты значениями, переданными в качестве аргументов. Он также имеет метод получения для доступа к атрибутам.
//     */
//
//    private String name;
//    private int age;
//
//    public Person(String name, int age) {
//        this.name = name;
//        this.age = age;
//    }
//
//    public String getName() {
//        return name;
//    }
//
//    public int getAge() {
//        return age;
//    }
//}
