package BasicExercises.Object_Oriented_Programming;

public class Object_Oriented_Programming2 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания класса «Собака» с именем и атрибутом породы. Создайте два
        экземпляра класса «Собака», задайте их атрибуты с помощью конструктора и измените атрибуты с помощью методов
        установки и распечатайте обновленные значения.

        Объяснение:

        В приведенном выше примере кода мы создаем два экземпляра класса «Собака», устанавливаем их атрибуты через
        конструктор и печатаем их имя и породу с помощью методов получения. Мы также изменяем атрибуты с помощью
        методов установки и печатаем обновленные значения.
         */

//        Dog dog1 = new Dog("Reks", "German Shepherd");
//        Dog dog2 = new Dog("Hachiko", "Akita inu");
//
//        System.out.println("Dog 1:\n name: " + dog1.getName() + "\n breed: " + dog1.getBreed());
//        System.out.println("Dog 2:\n name: " + dog2.getName() + "\n breed: " + dog2.getBreed());
//
//        dog1.setName("Lari");
//        dog2.setBreed("Golden Retriever");
//
//        System.out.println("Dog 1:\n new name: " + dog1.getName() + "\n breed: " + dog1.getBreed());
//        System.out.println("Dog 2:\n name: " + dog2.getName() + "\n new breed: " + dog2.getBreed());
    }
}

//class Dog {
//
//    /*
//    Объяснение:
//
//    Приведенный выше класс имеет два частных атрибута: «имя» и «порода», а также конструктор, который инициализирует
//    эти атрибуты значениями, переданными в качестве аргументов. Он также имеет методы получения и установки для
//    доступа и изменения этих атрибутов.
//     */
//
//    private String name;
//    private String breed;
//
//    public Dog(String name, String breed) {
//        this.name = name;
//        this.breed = breed;
//    }
//
//    public String getName() {
//        return name;
//    }
//
//    public String getBreed() {
//        return breed;
//    }
//
//    public void setName(String name) {
//        this.name = name;
//    }
//
//    public void setBreed(String breed) {
//        this.breed = breed;
//    }
//}
