package BasicExercises.Stack;

public class Stack {

    public static void main(String[] args) {

        /*
        Java стэк

        1. Напишите программу на Java для реализации стека с операциями push и pop. Найдите верхний элемент стека и
        проверьте, пуст он или нет.

        2. Напишите программу на Java для сортировки элементов заданного стека в порядке возрастания.

        3. Напишите Java-программу для сортировки элементов стека по убыванию.

        4. Напишите программу на Java, переворачивающую элементы стека.

        5. Напишите программу на Java для поиска максимального и минимального элементов в стеке.

        6. Напишите программу на Java для удаления всех элементов из стека.

        7. Напишите программу на Java для подсчета всех элементов стека.

        8. Напишите программу на Java для реализации стека, который проверяет, присутствует ли в стеке данный
        элемент или нет.

        9. Напишите программу на Java для удаления дубликатов из заданного стека.

        10. Напишите программу на Java для поиска верхних и нижних элементов заданного стека.

        11. Напишите программу на Java для поворота элементов стека в правильном направлении.

        12. Напишите программу на Java для поворота элементов стека влево.

        13. Напишите программу на Java для удаления определенного элемента из стека.

        14. Напишите программу на Java, которая меняет местами два верхних элемента заданного стека.

        15. Напишите программу на Java, чтобы получить n-й элемент с вершины стека.

        16. Напишите программу на Java, чтобы получить n-й элемент снизу стека.

        17. Напишите программу на Java для реализации стека и перемещения n-го элемента с вершины стека наверх.

        18. Напишите программу на Java для объединения двух стеков в один.

        19. Напишите программу на JavaScript, которая реализует стек и проверяет, является ли этот стек подмножеством
        другого стека.

        20. Напишите программу на Java, которая реализует стек и проверяет, равны ли два стека.

        21. Напишите программу на Java, которая реализует стек и находит общие элементы между двумя стеками.

        22. Напишите программу на Java, реализующую стек, и найдите элементы, находящиеся в первом стеке, но
        отсутствующие во втором.

        23. Напишите программу на Java, реализующую стек и создающую новый стек, содержащий все элементы из двух
        стеков без дубликатов.

        24. Напишите программу на Java, которая реализует стек и создает новый стек из части исходного стека.

        25. Напишите программу на Java, реализующую стек и создающую новый стек, содержащий только элементы,
        находящиеся либо в первом, либо во втором стеке, но не в обоих.

        26. Напишите программу на Java, которая реализует стек и проверяет, все ли элементы стека удовлетворяют условию.

        27. Напишите программу на Java, реализующую стек и проверяющую, удовлетворяет ли хотя бы один элемент стека условию.

        28. Напишите программу на Java, реализующую стек, и создайте новый стек, удаляя элементы,
        не удовлетворяющие условию.

        29. Напишите программу на Java для реализации стека с использованием связанного списка.
         */
    }
}
