package BasicExercises.Stack;

import java.util.Stack;

public class Stack8 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для реализации стека, который проверяет, присутствует ли в стеке данный
        элемент или нет.
         */

//        Stack <String> stack = new Stack();
//
//        stack.push("Red");
//        stack.push("Green");
//        stack.push("Black");
//
//        System.out.println("Original stack:\n" + stack);
//
//        System.out.println("Does the stack contains 'Green'?: " + stack.contains("Green"));
    }
}
