package BasicExercises.Stack;

import java.util.Stack;

public class Stack9 {

    // Функция для удаления дубликатов из Stack
//    public static <T> Stack <T> removeDuplicates(Stack <T> stack) {
//
//        // Создайте новый Stack
//        Stack <T> newStack = new Stack<T>();
//
//        // Переход по первому списку
//        for (T element : stack) {
//
//            // Если этот элемент отсутствует в newList
//            // затем добавьте его
//            if(!newStack.contains(element)) {
//                newStack.add(element);
//            }
//        }
//        // возвращает новый список
//        return newStack;
//    }

    public static void main(String[] args) {

        /*
        Напишите программу на Java для удаления дубликатов из заданного стека.
         */

//        Stack <String> stack = new Stack();
//
//        stack.push("Red");
//        stack.push("Green");
//        stack.push("Black");
//        stack.push("Green");
//        stack.push("Black");
//
//
//        System.out.println("Original stack:\n" + stack);
//
//        // Удалить дубликаты
//        Stack<String>newStack = removeDuplicates(stack);
//
//        System.out.println("Stack with duplicates removed:\n" + newStack);
    }
}
