package BasicExercises.Collection.ArrayList;

public class ArrayList {

    public static void main(String[] args) {

        /*
        Коллекция Java: упражнения ArrayList

        1. Напишите программу на Java для создания списка массивов, добавления цветов (строк) и вывода коллекции.

        2. Напишите программу на Java для перебора всех элементов в списке массивов.

        3. Напишите программу на Java для вставки элемента в список массивов в первую позицию.

        4. Напишите программу на Java для извлечения элемента (по указанному индексу) из заданного списка массивов.

        5. Напишите программу на Java для обновления элемента массива заданным элементом.

        6. Напишите программу на Java для удаления третьего элемента из списка массивов.

        7. Напишите программу на Java для поиска элемента в списке массивов.

        8. Напишите программу на Java для сортировки заданного списка массивов.

        9. Напишите программу на Java для копирования одного списка массивов в другой.

        10. Напишите программу на Java для перемешивания элементов в списке массивов.

        11. Напишите программу на Java, чтобы поменять местами элементы в списке массивов.

        12. Напишите программу на Java для извлечения части списка массивов.

        13. Напишите программу на Java для сравнения двух списков-массивов.

        14. Напишите программу на Java, которая меняет местами два элемента в списке массивов.

        15. Напишите программу на Java для объединения двух списков-массивов.

        16. Напишите программу на Java для клонирования списка массивов в другой список массивов.

        17. Напишите программу на Java для очистки списка массивов.

        18. Напишите программу на Java, чтобы проверить, пуст ли список массивов.

        19. Напишите программу на Java для сокращения емкости списка массивов.

        20. Напишите программу на Java для увеличения размера списка массивов.

        21. Напишите программу на Java для замены второго элемента ArrayList указанным элементом.

        22. Напишите программу на Java для вывода всех элементов ArrayList, используя положение элементов.
         */
    }
}
