package BasicExercises.Abstract_Classes;

public class AbstractClasses4 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания абстрактного класса Animal с абстрактными методами eat() и sleep().
        Создайте подклассы Lion, Tiger и Deer, которые расширяют класс Animal и по-разному реализуют методы
        eat() и sleep() в зависимости от их конкретного поведения.

        В этой программе класс Animal является абстрактным классом, который определяет абстрактные методы
        eat() и sleep(). Классы Lion, Tiger и Deer расширяют класс Animal и предоставляют собственные реализации
        методов eat() и sleep() на основе их специфического поведения. Класс Main демонстрирует использование этих
        классов, создавая объекты каждого подкласса и вызывая соответственно методы eat() и sleep().
         */

//        Lion lion = new Lion();
//        Tiger tiger = new Tiger();
//        Deer deer = new Deer();
//
//        lion.eat();
//        lion.sleep();
//        tiger.eat();
//        tiger.sleep();
//        deer.eat();
//        deer.sleep();
    }
}

//abstract class Animal {
//
//    abstract void eat();
//    abstract void sleep();
//}
//
//class Lion extends Animal {
//
//    @Override
//    public void eat() {
//        System.out.println("The lion eats");
//    }
//    @Override
//    public void sleep() {
//        System.out.println("The lion is sleeping");
//    }
//}
//
//class Tiger extends Animal {
//
//    @Override
//    public void eat(){
//        System.out.println("The tiger eats");
//    }
//    @Override
//    public void sleep() {
//        System.out.println("The tiger is sleeping");
//    }
//}
//
//class Deer extends Animal {
//
//    @Override
//    public void eat(){
//        System.out.println("The deer eats");
//    }
//    @Override
//    public void sleep() {
//        System.out.println("The deer is sleeping");
//    }
//}
