package BasicExercises.Abstract_Classes;

public class AbstractClasses {

    public static void main(String[] args) {

        /*
        Абстрактные классы Java

        1. Напишите программу на Java для создания абстрактного класса Animal с абстрактным методом sound().
        Создайте подклассы Lion и Tiger, которые расширяют класс Animal и реализуют метод sound() для воспроизведения
        определенного звука для каждого животного.

        2. Напишите программу на Java для создания абстрактного класса Shape с абстрактными методами
        calculateArea() и calculatePerimeter(). Создайте подклассы Circle и Triangle, которые расширяют класс Shape
        и реализуют соответствующие методы для вычисления площади и периметра каждой фигуры.

        3. Напишите программу на Java для создания абстрактного класса BankAccount с абстрактными методами
        deposit() и remove(). Создайте подклассы: SavingsAccount и CurrentAccount, которые расширяют класс
        BankAccount и реализуют соответствующие методы для обработки депозитов и снятия средств для каждого типа счета.

        4. Напишите программу на Java для создания абстрактного класса Animal с абстрактными методами eat() и sleep().
        Создайте подклассы Lion, Tiger и Deer, которые расширяют класс Animal и по-разному реализуют методы
        eat() и sleep() в зависимости от их конкретного поведения.

        5. Напишите программу Java для создания абстрактного класса Employee с абстрактными методами
        calculateSalary() и displayInfo(). Создайте подклассы Manager и Programmer, которые расширяют
        класс Employee и реализуют соответствующие методы для расчета заработной платы и отображения
        информации для каждой роли.

        6. Напишите программу Java для создания абстрактного класса Shape3D с абстрактными методами
        calculateVolume() и calculateSurfaceArea(). Создайте подклассы Sphere и Cube, расширяющие класс
        Shape3D, и реализуйте соответствующие методы для вычисления объема и площади поверхности каждой формы.

        7. Напишите программу на Java для создания абстрактного класса Vehicle с абстрактными методами
        startEngine() и stopEngine(). Создайте подклассы Car и Motorcycle, которые расширяют класс Vehicle и
        реализуют соответствующие методы для запуска и остановки двигателей для каждого типа транспортных средств.

        8. Напишите программу на Java для создания абстрактного класса Person с абстрактными методами
        eat() и Exercise(). Создайте подклассы Athlete и LazyPerson, которые расширяют класс Person и
        реализуют соответствующие методы для описания того, как каждый человек ест и тренируется.

        9. Напишите программу на Java для создания абстрактного класса Instrument с абстрактными методами
        play() и tune(). Создайте подклассы для Glockenspiel и Violin, которые расширяют класс Instrument и
        реализуют соответствующие методы для игры и настройки каждого инструмента.

        10. Напишите программу на Java для создания абстрактного класса Shape2D с абстрактными методами
        draw() и resize(). Создайте подклассы Rectangle и Circle, которые расширяют класс Shape2D и
        реализуют соответствующие методы для рисования и изменения размера каждой фигуры.

        11. Напишите программу на Java для создания абстрактного класса Bird с абстрактными методами
        fly() и makeSound(). Создайте подклассы Eagle и Hawk, расширяющие класс Bird, и реализуйте соответствующие
        методы для описания того, как каждая птица летает и издает звук.

        12. Напишите программу на Java для создания абстрактного класса GeometricShape с абстрактными методами
        area() и perimeter(). Создайте подклассы Triangle и Square, которые расширяют класс GeometricShape и
        реализуют соответствующие методы для вычисления площади и периметра каждой фигуры.
         */
    }
}
