package BasicExercises.Abstract_Classes;

public class AbstractClasses1 {

    public static void main(String[] args) {

        /*
        Напишите программу Java для создания абстрактного класса Animal с абстрактным методом sound().
        Создайте подклассы Lion и Tiger, которые расширяют класс Animal и реализуют метод sound() для воспроизведения
        определенного звука для каждого животного.

        Вышеупомянутое упражнение представляет структуру класса и отношения между абстрактным классом и его подклассами.

        В следующем коде класс Animal показан как абстрактный класс с абстрактным методом sound().
        Классы Lion и Tiger являются подклассами Animal и предоставляют свои собственные реализации sound().
        Стрелка указывает на отношение наследования, где Лев и Тигр наследуют от Животного.
         */

//        Animal lion = new Lion();
//        Animal tiger = new Tiger();
//        lion.sound();
//        tiger.sound();
    }
}

//abstract class Animal {
//
//    abstract void sound();
//}
//
//class Lion extends Animal {
//
//    @Override
//    public void sound() {
//        System.out.println("The Lion's Roar!");
//    }
//}
//
//class Tiger extends Animal {
//
//    @Override
//    public void sound() {
//        System.out.println("Tiger Roar!");
//    }
//}
