package BasicExercises.Collection.TreeSet;

public class TreeSet {

    public static void main(String[] args) {

        /*
        Коллекция Java: упражнения TreeSet

        1. Напишите программу на Java для создания набора деревьев, добавьте несколько цветов (строк) и распечатайте набор деревьев.
        Нажмите на меня, чтобы увидеть решение

        2. Напишите программу на Java для перебора всех элементов в древовидном наборе.
        Нажмите на меня, чтобы увидеть решение

        3. Напишите программу на Java для добавления всех элементов указанного набора деревьев в другой набор деревьев.
        Нажмите на меня, чтобы увидеть решение

        4. Напишите программу на Java для создания представления в обратном порядке элементов, содержащихся в заданном древовидном наборе.
        Нажмите на меня, чтобы увидеть решение

        5. Напишите программу на Java для получения первого и последнего элементов в древовидном наборе.
        Нажмите на меня, чтобы увидеть решение

        6. Напишите программу на Java для клонирования списка наборов деревьев в другой набор деревьев.
        Нажмите на меня, чтобы увидеть решение

        7. Напишите программу на Java для получения количества элементов в наборе деревьев.
        Нажмите на меня, чтобы увидеть решение

        8. Напишите программу на Java для сравнения двух наборов деревьев.
        Нажмите на меня, чтобы увидеть решение

        9. Напишите программу на Java для поиска чисел меньше 7 в древовидном наборе.
        Нажмите на меня, чтобы увидеть решение

        10. Напишите программу на Java, чтобы получить элемент в наборе деревьев, который больше или равен заданному элементу.
        Нажмите на меня, чтобы увидеть решение

        11. Напишите программу на Java, чтобы получить элемент в дереве, который меньше или равен заданному элементу.
        Нажмите на меня, чтобы увидеть решение

        12. Напишите программу на Java, чтобы получить элемент в дереве, строго больший или равный заданному элементу.
        Нажмите на меня, чтобы увидеть решение

        13. Напишите программу на Java, чтобы получить элемент в наборе деревьев, который имеет меньшее значение, чем заданный элемент.
        Нажмите на меня, чтобы увидеть решение

        14. Напишите программу на Java для извлечения и удаления первого элемента набора деревьев.
        Нажмите на меня, чтобы увидеть решение

        15. Напишите программу на Java для извлечения и удаления последнего элемента набора деревьев.
        Нажмите на меня, чтобы увидеть решение

        16. Напишите программу на Java для удаления заданного элемента из набора деревьев.
         */
    }
}
