package BasicExercises.Inheritance;

public class Inheritance {

    public static void main(String[] args) {

        /*
        Упражнения по наследованию в Java

        1. Напишите программу Java для создания класса Animal с методом makeSound(). Создайте подкласс с именем Cat,
        который заменяет метод makeSound() на лай.

        2. Напишите программу на Java для создания класса Vehicle с методом drive(). Создайте подкласс с именем Car,
        который переопределяет метод drive() для печати «Ремонт автомобиля».

        3. Напишите программу на Java для создания класса Shape с методом getArea(). Создайте подкласс Rectangle,
        который переопределяет метод getArea() для вычисления площади прямоугольника.

        4. Напишите программу на Java для создания класса Employee с методами work() и getSalary(). Создайте подкласс с
        именем HRManager, который переопределяет метод work() и добавляет новый метод с именем addEmployee().

        5. Напишите программу на Java для создания класса, известного как «BankAccount», с методами, называемыми
        deposit() и remove(). Создайте подкласс SavingsAccount, который переопределяет метод remove(), чтобы
        предотвратить снятие средств, если баланс счета падает ниже ста.

        6. Напишите программу на Java для создания класса Animal с методом move(). Создайте подкласс Cheetah, который
        переопределяет метод move() для запуска.

        7. Напишите программу на Java для создания класса Person с методами getFirstName() и getLastName(). Создайте
        подкласс с именем Employee, который добавляет новый метод с именем getEmployeeId() и переопределяет метод
        getLastName(), чтобы включить название должности сотрудника.

        8. Напишите программу на Java для создания класса Shape с методами getPerimeter() и getArea().
        Создайте подкласс Circle, который переопределяет методы getPerimeter() и getArea() для вычисления
        площади и периметра круга.

        9. Напишите программу на Java для создания иерархии классов транспортных средств. Базовым классом должен быть
        Vehicle с подклассами Truck, Car и Motorcycle. Каждый подкласс должен иметь такие свойства, как марка, модель,
        год и тип топлива. Внедрить методы расчета эффективности использования топлива, пройденного
        расстояния и максимальной скорости.
         */
    }
}
