package BasicExercises.Inheritance;

public class Inheritance1 {

    public static void main(String[] args) {

        /*
        Напишите программу Java для создания класса Animal с помощью метода makeSound(). Создайте подкласс с именем Cat,
        который заменяет метод makeSound() на лай.

        В этом упражнении показано, как наследование работает в языке программирования Java. Наследование позволяет
        создавать новые классы на основе существующих классов, наследуя их атрибуты и поведение. В данном случае
        класс «Кошка» является более конкретной реализацией класса «Животное», добавляя агрессивное поведение.

        Объяснение:

        В приведенном выше упражнении демонстрируется наследование в программировании на Java. В этой программе мы
        создаем базовый класс под названием «Животное» с методом makeSound(). Затем вы создадите подкласс «Животное»
        под названием «Кошка», который наследуется от «Животного». Класс 'Cat' переопределит метод makeSound() и
        изменит его, чтобы издавать звук ссоры.
         */

//        Animal animal = new Animal();
//        animal.makeSound();
//        Cat cat = new Cat();
//        cat.makeSound();
    }
}

//class Animal {
//
//    void makeSound() {
//        System.out.println("The animal makes a sound");
//    }
//}
//
//class Cat extends Animal {
//
//    @Override
//    public void makeSound() {
//        System.out.println("The cat meows");
//    }
//}
