package BasicExercises.Inheritance;

public class Inheritance3 {

    public static void main(String[] args) {

        /*
        Напишите программу Java для создания класса Shape с методом getArea(). Создайте подкласс Rectangle, который
        переопределяет метод getArea() для вычисления площади прямоугольника.

        Объяснение:

        В приведенном выше упражнении класс Shape имеет единственный метод с именем getArea(), который возвращает
        двойное значение. Класс Rectangle является подклассом Shape и переопределяет метод getArea() для вычисления
        площади прямоугольника с использованием формулы длина x ширина. Конструктор класса Rectangle устанавливает
        значения длины и ширины.

        Наконец, в методе main() мы создаем экземпляр класса Rectangle и вызываем его метод getArea() для
        получения площади прямоугольника.
         */

//        Shape shape = new Shape();
//        shape.getArea();
//        Rectangle rectangle = new Rectangle();
//        rectangle.length = 15.854;
//        rectangle.width = 22.65;
//        System.out.println("Length = " + rectangle.length);
//        System.out.println("Width = " + rectangle.width);
//        rectangle.getArea();
    }
}

//class Shape {
//
//    public void getArea() {
//        System.out.println("Area calculation method");
//    }
//}
//
//class Rectangle extends Shape {
//    double length;
//    double width;
//
//    @Override
//    public void getArea() {
//        double area;
//        area = this.length * this.width;
//        System.out.println("Area of rectangle is : " + area);
//    }
//}
