package BasicExercises.Inheritance;

public class Inheritance6 {

    public static void main(String[] args) {

        /*
        Напишите программу Java для создания класса Animal с методом move(). Создайте подкласс Cheetah, который
        переопределяет метод move() для запуска.

        Объяснение:

        В приведенном выше упражнении класс Animal имеет единственный метод с именем move(). Этот метод просто выводит
        на консоль сообщение о том, что животное движется. Класс Cheetah расширяет класс Animal и переопределяет метод
        move() для вывода сообщения о том, что Cheetah работает.

        В классе Main мы создаем экземпляр класса Animal и вызываем его метод move(). Это выводит на консоль сообщение
        «Это животное движется». Мы также создаем экземпляр класса Cheetah и вызываем его метод move(). Это выводит
        на консоль сообщение «Этот гепард работает».
         */

//        Animal animal = new Animal();
//        animal.move();
//        Cheetah cheetah = new Cheetah();
//        cheetah.move();
    }
}

//class Animal {
//
//    public void move() {
//        System.out.println("The animal is moving");
//    }
//}
//
//class Cheetah extends Animal {
//
//    @Override
//    public void move() {
//        System.out.println("This cheetah is running!");
//    }
//}
