package BasicExercises.Collection.HashSet;

public class HashSet {

    public static void main(String[] args) {

        /*
        Коллекция Java: упражнения HashSet

        1. Напишите программу на Java для добавления указанного элемента в конец набора хэшей.

        2. Напишите программу на Java для перебора всех элементов в хэш-списке.

        3. Напишите программу на Java для получения количества элементов в хеш-наборе.

        4. Напишите программу на Java для очистки набора хэшей.

        5. Напишите программу на Java, чтобы проверить, является ли набор хэшей пустым или нет.

        6. Напишите программу на Java для клонирования набора хэшей в другой набор хэшей.

        7. Напишите программу на Java для преобразования набора хэшей в массив.

        8. Напишите программу на Java для преобразования хеш-набора в древовидный набор.

        9. Напишите программу на Java для поиска чисел меньше 7 в древовидном наборе.

        10. Напишите программу на Java для сравнения двух наборов хэшей.

        11. Напишите программу на Java для сравнения двух наборов и сохранения одинаковых элементов.

        12. Напишите программу на Java для удаления всех элементов из набора хэшей.
         */
    }
}
