package BasicExercises.Collection.LinkedList;

public class LinkedList {

    public static void main(String[] args) {

        /*
        1. Напишите программу на Java, чтобы добавить указанный элемент в конец связанного списка.

        2. Напишите программу на Java для перебора всех элементов связанного списка.

        3. Напишите программу на Java для перебора всех элементов связанного списка, начиная с указанной позиции.

        4. Напишите программу на Java для итерации связанного списка в обратном порядке.

        5. Напишите программу Java для вставки указанного элемента в указанную позицию в связанном списке.

        6. Напишите программу на Java для вставки элементов в связанный список в первую и последнюю позиции.

        7. Напишите программу на Java для вставки указанного элемента в начало связанного списка.

        8. Напишите программу на Java для вставки указанного элемента в конец связанного списка.

        9. Напишите программу на Java для вставки некоторых элементов в указанной позиции в связанный список.

        10. Напишите программу на Java, чтобы получить первое и последнее вхождение указанных элементов в связанный список.

        11. Напишите программу на Java для отображения элементов и их позиций в связанном списке.

        12. Напишите программу на Java для удаления указанного элемента из связанного списка.

        13. Напишите программу на Java для удаления первого и последнего элементов из связанного списка.

        14. Напишите программу на Java для удаления всех элементов из связанного списка.

        15. Напишите программу на Java, которая меняет местами два элемента в связанном списке.

        16. Напишите программу на Java для перемешивания элементов в связанном списке.

        17. Напишите программу на Java для объединения двух связанных списков.

        18. Напишите программу на Java для копирования связанного списка в другой связанный список.

        19. Напишите программу на Java для удаления и возврата первого элемента связанного списка.

        20. Напишите программу на Java, которая извлекает, но не удаляет первый элемент связанного списка.

        21. Напишите программу на Java для извлечения, но не удаления последнего элемента связанного списка.

        22. Напишите программу на Java, чтобы проверить, существует ли конкретный элемент в связанном списке.

        23. Напишите программу на Java для преобразования связанного списка в список-массив.

        24. Напишите программу на Java для сравнения двух связанных списков.

        25. Напишите программу на Java, чтобы проверить, является ли связанный список пустым или нет.

        26. Напишите программу на Java для замены элемента в связанном списке.
         */
    }
}
