package BasicExercises.Collection.PriorityQueue;

public class PriorityQueue {

    public static void main(String[] args) {

        /*
        Коллекция Java: упражнения PriorityQueue

        1. Напишите программу на Java для создания очереди с приоритетом,
        добавьте несколько цветов (строк) и распечатайте элементы очереди с приоритетом.

        2. Напишите программу на Java для перебора всех элементов в очереди приоритетов.

        3. Напишите программу на Java для добавления всех элементов очереди с приоритетом в другую очередь с приоритетом.

        4. Напишите программу на Java для вставки заданного элемента в приоритетную очередь.

        5. Напишите программу на Java для удаления всех элементов из очереди с приоритетом.

        6. Напишите программу на Java для подсчета количества элементов в очереди с приоритетом.

        7. Напишите программу на Java для сравнения двух очередей с приоритетом.

        8. Напишите программу на Java для получения первого элемента приоритетной очереди.

        9. Напишите программу на Java для извлечения и удаления первого элемента.

        10. Напишите программу на Java для преобразования приоритетной очереди в массив, содержащий все ее элементы.

        11. Напишите программу на Java для преобразования элемента Priority Queue в строковые представления.

        12. Напишите программу на Java, чтобы изменить priorityQueue на очередь с максимальным приоритетом.
         */
    }
}
