package BasicExercises.Enum;

public class Enum3 {

    //Мой вариант

//        enum Shape {
//            Circle,
//            Triangle,
//            Square
//        }

    //Вариант 2

//    public enum Shape {
//        SQUARE,
//        CIRCLE,
//        RECTANGLE,
//        TRIANGLE,
//        HEXAGON
//    }

    public static void main(String[] args) {

        /*
        Напишите программу на Java для реализации перечисления под названием «Shape» с константами, представляющими
        различные геометрические фигуры.

        Объяснение:

        Мы реализуем перечисление Shape с пятью значениями, представляющими геометрические фигуры:
        CIRCLE, SQUARE, TRIANGLE, RECTANGLE и HEXAGON. Мы создаем две переменные, shape1 и shape2, оба типа Shape, и
        присваиваем им значения CIRCLE и SQUARE. Наконец, мы печатаем значения shape1 и shape2,
        используя System.out.println().
         */

        //Мой вариант

//        Shape circle = Shape.Circle;
//        Shape triangle = Shape.Triangle;
//        Shape square = Shape.Square;
//
//        System.out.println("Figure 1: " + circle);
//        System.out.println("Figure 2: " + triangle);
//        System.out.println("Figure 3: " + square);

        //Вариант 2

//        Shape shape1 = Shape.CIRCLE;
//        Shape shape2 = Shape.SQUARE;
//
//        System.out.println("First shape: " + shape1);
//        System.out.println("Second shape: " + shape2);
    }
}
