package BasicExercises.Enum;

public class Enum2 {

//    public enum Weekend {
//        SATURDAY,
//        SUNDAY
//    }

    public static void main(String[] args) {

        /*
        Напишите Java-программу для создания перечисления под названием «Выходные» с константами,
        представляющими дни выходных.

        Объяснение:

        В приведенном выше упражнении мы определяем перечисление Weekend с двумя значениями, представляющими выходные дни,
        SATURDAY и SUNDAY. Внутри основного метода мы создаем две переменные, day1 и day2, обе с типом Weekend, и
        присваиваем им соответствующие значения SATURDAY и SUNDAY. Наконец, мы печатаем значения day1 и day2,
        используя System.out.println().
        */

//        Weekend day1 = Weekend.SATURDAY;
//        Weekend day2 = Weekend.SUNDAY;
//
//        System.out.println("First day of the weekend: " + day1);
//        System.out.println("Second day of the weekend: " + day2);
    }
}
