package BasicExercises.Enum;

public class Enum {

    public static void main(String[] args) {

        /*
        Упражнения с перечислением в Java

        1. Напишите программу на Java для создания перечисления DaysOfWeek, представляющего дни недели.

        2. Напишите Java-программу для создания перечисления под названием «Выходные» с константами,
        представляющими дни выходных.

        3. Напишите программу на Java для реализации перечисления под названием «Shape» с константами, представляющими
        различные геометрические фигуры.

        4. Напишите программу на Java для реализации перечисления под названием «Направление» с константами,
        представляющими стороны света (север, юг, восток, запад).

        5. Напишите программу на Java, которая определяет перечисление под названием «Месяцы» с константами,
        представляющими месяцы года.
         */
    }
}
