package BasicExercises.Enum;

public class Enum5 {

    //Мой вариант
//    enum Months {
//        January,
//        February,
//        March,
//        April,
//        May,
//        June,
//        July,
//        August,
//        September,
//        October,
//        November,
//        December
//    }

    //Вариант 2

//    public enum Months {
//        JANUARY,
//        FEBRUARY,
//        MARCH,
//        APRIL,
//        MAY,
//        JUNE,
//        JULY,
//        AUGUST,
//        SEPTEMBER,
//        OCTOBER,
//        NOVEMBER,
//        DECEMBER
//    }

    public static void main(String[] args) {

        /*
        Напишите программу на Java, которая определяет перечисление под названием «Месяцы» с константами,
        представляющими месяцы года.

        Объяснение:

        Вышеприведенная программа определяет перечисление Months с двенадцатью значениями, представляющими месяцы года:
        ЯНВАРЬ, ФЕВРАЛЬ, МАРТ, АПРЕЛЬ, МАЙ, ИЮНЬ, ИЮЛЬ, АВГУСТ, СЕНТЯБРЬ, ОКТЯБРЬ, НОЯБРЬ и ДЕКАБРЬ. Внутри основного
        метода мы создаем переменную currentMonth типа Months и присваиваем ей значение MAY. Наконец, мы печатаем
        значение currentMonth, используя System.out.println().
         */

        //Мой вариант

//        Months month = Months.June;
//
//        System.out.println("Current month: " + month);

        //Вариант 2

//        Months currentMonth = Months.MAY;
//        System.out.println("Current month: " + currentMonth);
    }
}
