package BasicExercises.Collection.TreeMap;

public class TreeMap {

    public static void main(String[] args) {

        /*
        Коллекция Java: упражнения TreeMap

        1. Напишите программу Java, чтобы связать указанное значение с указанным ключом в карте дерева.
        Нажмите на меня, чтобы увидеть решение

        2. Напишите программу на языке Java для копирования содержимого карты дерева в другую карту дерева.
        Нажмите на меня, чтобы увидеть решение

        3. Напишите программу на Java для поиска ключа в карте дерева.
        Нажмите на меня, чтобы увидеть решение

        4. Напишите программу на Java для поиска значения в древовидной карте.
        Нажмите на меня, чтобы увидеть решение

        5. Напишите программу на Java, чтобы получить все ключи из древовидной карты.
        Нажмите на меня, чтобы увидеть решение

        6. Напишите программу на Java для удаления всех элементов из древовидной карты.
        Нажмите на меня, чтобы увидеть решение

        7. Напишите программу на Java для сортировки ключей в древовидной карте с помощью компаратора.
        Нажмите на меня, чтобы увидеть решение

        8. Напишите программу на Java, чтобы получить сопоставление ключ-значение, связанное с наибольшим и наименьшим ключом в сопоставлении.
        Нажмите на меня, чтобы увидеть решение

        9. Напишите программу на Java, чтобы получить первый (самый низкий) ключ и последний (самый высокий) ключ в карте.
        Нажмите на меня, чтобы увидеть решение

        10. Напишите программу на Java, чтобы получить обратный порядок ключей, содержащихся в заданной карте.
        Нажмите на меня, чтобы увидеть решение

        11. Напишите программу на Java, чтобы получить сопоставление ключ-значение, связанное с наибольшим ключом, меньшим или равным заданному ключу.
        Нажмите на меня, чтобы увидеть решение

        12. Напишите программу на Java, чтобы получить наибольший ключ, меньший или равный заданному ключу.
        Нажмите на меня, чтобы увидеть решение

        13. Напишите программу на Java, чтобы получить часть карты, ключи которой строго меньше заданного ключа.
        Нажмите на меня, чтобы увидеть решение

        14. Напишите программу на Java, чтобы получить часть этой карты, ключи которой меньше (или равны, если включительно) заданному ключу.
        Нажмите на меня, чтобы увидеть решение

        15. Напишите программу на Java, чтобы получить наименьший ключ, строго больший заданного ключа. Возвращает null, если такого ключа нет.
        Нажмите на меня, чтобы увидеть решение

        16. Напишите программу на Java, чтобы получить сопоставление ключ-значение, связанное с наибольшим ключом, строго меньшим заданного ключа. Возвращает null, если такого ключа нет.
        Нажмите на меня, чтобы увидеть решение

        17. Напишите программу на Java, чтобы получить наибольший ключ, строго меньший заданного ключа. Возвращает null, если такого ключа нет.
        Нажмите на меня, чтобы увидеть решение

        18. Напишите программу на Java, чтобы получить представление NavigableSet ключей на карте.
        Нажмите на меня, чтобы увидеть решение

        19. Напишите программу на Java, чтобы удалить и получить сопоставление ключ-значение, связанное с наименьшим ключом в сопоставлении.
        Нажмите на меня, чтобы увидеть решение

        20. Напишите программу на Java, чтобы удалить и получить сопоставление ключ-значение, связанное с наибольшим ключом в этой карте.
        Нажмите на меня, чтобы увидеть решение

        21. Напишите программу на Java, чтобы получить часть карты, ключи которой находятся в диапазоне от данного ключа (включительно) до другого ключа (исключая).
        Нажмите на меня, чтобы увидеть решение

        22. Напишите программу на Java, чтобы получить часть карты, ключи которой находятся в диапазоне от заданного ключа до другого ключа.
        Нажмите на меня, чтобы увидеть решение

        23. Напишите программу на Java, чтобы получить часть карты, ключи которой больше или равны заданному ключу.
        Нажмите на меня, чтобы увидеть решение

        24. Напишите программу на Java, чтобы получить часть карты, ключи которой больше заданного ключа.
        Нажмите на меня, чтобы увидеть решение

        25. Напишите программу на Java, чтобы получить сопоставление ключ-значение, связанное с наименьшим ключом, большим или равным заданному ключу. Возвращает null, если такого ключа нет.
        Нажмите на меня, чтобы увидеть решение

        26. Напишите программу на Java, чтобы получить наименьший ключ, больший или равный заданному ключу. Возвращает null, если такого ключа нет.
         */
    }
}
