package BasicExercises.Collection.HashMap;

public class HashMap {

    public static void main(String[] args) {

        /*
        Коллекция Java: упражнения HashMap

        1. Напишите программу Java, чтобы связать указанное значение с указанным ключом в HashMap.

        2. Напишите программу на Java для подсчета количества сопоставлений ключ-значение (размер) на карте.

        3. Напишите программу на Java для копирования всех отображений с указанной карты на другую карту.

        4. Напишите программу на Java для удаления всех отображений с карты.

        5. Напишите программу на Java, чтобы проверить, содержит ли карта сопоставления ключ-значение (пустые) или нет.

        6. Напишите программу на Java, чтобы получить поверхностную копию экземпляра HashMap.

        7. Напишите программу на Java, чтобы проверить, содержит ли карта сопоставление для указанного ключа.

        8. Напишите программу на Java, чтобы проверить, содержит ли карта отображение для указанного значения.

        9. Напишите программу на Java для создания набора отображений, содержащихся в карте.

        10. Напишите программу на Java для получения значения указанного ключа на карте.

        11. Напишите программу на Java, чтобы получить представление набора ключей, содержащихся в этой карте.

        12. Напишите программу на Java, чтобы получить набор значений, содержащихся в этой карте.
         */
    }
}
