package BasicExercises.Math;

public class Math {

    public static void main(String[] args) {

        /*
        Java: математические упражнения

        1. Напишите программу на Java для округления результатов целочисленного деления.

        2. Напишите программу на Java для получения целых и дробных частей из значения типа double.

        3. Напишите программу на Java для проверки, является ли двойное число целым числом.

        4. Напишите программу Java для округления числа с плавающей запятой до указанных десятичных знаков.

        5. Напишите программу на Java для подсчета абсолютного уникального значения в массиве.

        6. Напишите программу на Java для обращения целого числа.

        7. Напишите программу на Java для преобразования римского числа в целое число.

        8. Напишите программу Java для преобразования целочисленного значения в абсолютное значение.

        9. Напишите программу на Java для преобразования плавающего значения в абсолютное значение.

        10. Напишите программу на Java, которая принимает значение числа с плавающей запятой и возвращает
        округленное значение с плавающей запятой.

        11. Напишите программу на Java, которая принимает два целых числа и возвращает истину,
        если одно из них равно 15 или если их сумма или разность равна 15.

        12. Напишите программу на Java для подсчета количества простых чисел, меньших заданного положительного числа.

        13. Напишите программу на Java, чтобы найти длину самой длинной последовательности нулей в двоичном
        представлении целого числа.

        14. Напишите программу на Java для нахождения квадратного корня числа с помощью вавилонского метода.

        15. Напишите программу на Java для умножения двух целых чисел без умножения, деления, побитовых операций и циклов.

        16. Напишите программу на Java для вычисления степени числа без использования операторов умножения (*) и деления (/).

        17. Напишите программу на Java для вычисления и печати среднего (или среднего) потока заданных чисел.

        18. Напишите программу на Java для подсчета чисел без 7 от 1 до заданного числа.

        19. Напишите программу на Java для создания магического квадрата порядка n (суммы по всем строкам,
        столбцам и диагоналям равны).
        Из Википедии,
        в развлекательной математике и комбинаторном дизайне магический квадрат представляет собой
        квадратную сетку xn (где n - количество ячеек с каждой стороны), заполненную различными
        положительными целыми числами в диапазоне 1, 2, ..., n 2 такие, что каждый ячейка содержит разные целые числа,
        и сумма целых чисел в каждой строке, столбце и диагонали равна. Сумма называется магической константой
        или магической суммой магического квадрата. Говорят, что квадратная сетка с n ячейками на каждой
        стороне имеет порядок n.

        20. В математике решето Эратосфена — это древний алгоритм нахождения всех простых чисел до любого заданного предела.
        Напишите программу на Java для вывода всех простых чисел, меньших или равных заданному числу.

        21. Напишите программу на Java, чтобы найти число с максимальным количеством различных
        простых множителей в заданном диапазоне.

        22. Напишите программу на Java для поиска следующего наименьшего палиндрома.

        23. Быстрая схема вычисления многочлена типа:
        -19+ 7x- 4x 2 + 6x 3
        при
        x=3
        состоит в том, чтобы организовать вычисление следующим образом:((((0)x+6)x+(-4)) x+7)x+(-19)
        Напишите программу на Java для вычисления результата из самых внутренних скобок.

        24. Напишите программу на Java для вычисления биномиального коэффициента двух положительных чисел.

        25. Напишите программу на Java для вычисления e возведения в степень x,
        используя сумму первых n членов ряда Тейлора.

        26. Напишите программу на Java для вывода всех простых множителей заданного числа.

        27. Напишите программу на Java, чтобы проверить, является ли заданное число числом Фибоначчи или нет.

        28. Напишите программу на Java для умножения двух чисел с помощью побитовых операторов.

        29. Напишите программу на Java, чтобы найти имя столбца Excel, соответствующее заданному
        номеру столбца (целочисленное значение).

        30. Напишите программу на Java, чтобы найти угол между часовой и минутной стрелками.
         */
    }
}
