package BasicExercises.Date_calendar_and_time;

import java.util.Calendar;

public class Date_calendar_and_time1_37 {

    public static void main(String[] args) {

        System.out.println("Exercise 1");

        /*
        Напишите программу на Java для создания объекта Date с использованием класса Calendar.
         */

        //Мой вариант
        Calendar c = Calendar.getInstance();
        System.out.println("The Current Date is:\n" + c.getTime());

        //Вариант 2
    }
}
