package BasicExercises.Polymorphism;

public class Polymorphism {

    public static void main(String[] args) {

        /*
        Упражнения по полиморфизму в Java

        1. Напишите программу на Java для создания базового класса Animal (семейство животных) с помощью метода Sound().
        Создайте два подкласса Bird и Cat. Переопределите метод Sound() в каждом подклассе, чтобы издавать определенный
        звук для каждого животного.

        2. Напишите программу на Java для создания класса Vehicle с помощью метода SpeedUp(). Создайте два подкласса
        Car и Bicycle. Переопределите метод SpeedUp() в каждом подклассе, чтобы увеличить скорость автомобиля
        по-разному.

        3. Напишите программу на Java для создания базового класса Shape с помощью метода CalculationArea().
        Создайте три подкласса: Circle, Rectangle и Triangle. Переопределите метод CalculationArea() в каждом
        подклассе, чтобы вычислить и вернуть площадь фигуры.

        4. Напишите программу на Java для создания класса «Сотрудник» с помощью метода «calculSalary()». Создайте два
        подкласса Manager и Programmer. В каждом подклассе переопределите метод CalcultSalary() для расчета и возврата
        зарплаты в зависимости от их конкретных ролей.

        5. Напишите программу на Java для создания базового класса Sports с помощью метода play(). Создайте три
        подкласса: Футбол, Баскетбол и Регби. Переопределите метод play() в каждом подклассе, чтобы воспроизводить
        определенный оператор для каждого вида спорта.

        6. Напишите программу на Java для создания класса Shape с методами getArea() и getPerimeter(). Создайте три
        подкласса: Circle, Rectangle и Triangle. Переопределите методы getArea() и getPerimeter() в каждом подклассе,
        чтобы вычислить и вернуть площадь и периметр соответствующих фигур.

        7. Напишите программу на Java для создания базового класса Animal с помощью методов move() и makeSound().
        Создайте два подкласса Bird и Panthera. Переопределите метод move() в каждом подклассе, чтобы описать, как
        движется каждое животное. Кроме того, переопределите метод makeSound() в каждом подклассе, чтобы издавать
        определенный звук для каждого животного.

        8. Напишите программу на Java для создания базового класса Shape с методами draw() и CalculationArea().
        Создайте три подкласса: Круг, Квадрат и Треугольник. Переопределите метод draw() в каждом подклассе, чтобы
        нарисовать соответствующую фигуру, и переопределите метод CalculationArea(), чтобы вычислить и вернуть
        площадь каждой фигуры.

        9. Напишите программу на Java для создания базового класса BankAccount с методами депозита() и вывода().
        Создайте два подкласса SavingsAccount и CheckingAccount. Переопределите метод вывода() в каждом подклассе,
        чтобы установить разные лимиты и комиссии на снятие средств.

        10. Напишите программу на Java для создания базового класса Animal с методами eat() и sound(). Создайте три
        подкласса: Лев, Тигр и Пантера. Переопределите метод eat() в каждом подклассе, чтобы описать, что ест каждое
        животное. Кроме того, переопределите метод sound(), чтобы издавать определенный звук для каждого животного.

        11. Напишите программу на Java для создания базового класса Vehicle с методами startEngine() и stopEngine().
        Создайте два подкласса Car и Motorcycle. Переопределите методы startEngine() и stopEngine() в каждом
        подклассе, чтобы запускать и останавливать механизмы по-разному.

        12. Напишите программу на Java для создания базового класса Shape с методами draw() и CalculationArea().
        Создайте два подкласса Circle и Cylinder. Переопределите метод draw() в каждом подклассе, чтобы нарисовать
        соответствующую фигуру. Кроме того, переопределите метод CalculationArea() в подклассе Cylinder, чтобы
        вычислить и вернуть общую площадь поверхности цилиндра.
         */
    }
}
