package BasicExercises.Polymorphism;

public class Polymorphism5 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания базового класса Sports с помощью метода play(). Создайте три
        подкласса: Футбол, Баскетбол и Регби. Переопределите метод play() в каждом подклассе, чтобы воспроизводить
        определенный оператор для каждого вида спорта.
         */

//        Sports sports = new Sports();
//        Football football = new Football();
//        Basketball basketball = new Basketball();
//        Rugby rugby = new Rugby();
//
//        sports.play();
//        football.play();
//        basketball.play();
//        rugby.play();
    }
}

//class Sports {
//
//    public void play() {
//        System.out.println("Do sport");
//    }
//}
//
//class Football extends Sports{
//
//    @Override
//    public void play() {
//        System.out.println("Play football ");
//    }
//}
//
//class Basketball extends Sports{
//
//    @Override
//    public void play() {
//        System.out.println("Play basketball ");
//    }
//}
//
//class Rugby extends Sports{
//
//    @Override
//    public void play() {
//        System.out.println("Play rugby ");
//    }
//}