package BasicExercises.Polymorphism;

public class Polymorphism1 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания базового класса Animal (семейство животных) с помощью метода Sound().
        Создайте два подкласса Bird и Cat. Переопределите метод Sound() в каждом подклассе, чтобы издавать определенный
        звук для каждого животного.
         */

//        Animal animal = new Animal();
//        Bird bird = new Bird();
//        Cat cat = new Cat();
//
//        animal.sound();
//        bird.sound();
//        cat.sound();
    }
}

//class Animal {
//
//    public void sound() {
//        System.out.println("The animal makes a sound");
//    }
//}
//
//class Bird extends Animal{
//
//    @Override
//    public void sound() {
//        System.out.println("The bird makes a sound");
//    }
//}
//
//class Cat extends Animal{
//
//    @Override
//    public void sound() {
//        System.out.println("The cat makes a sound");
//    }
//}