package BasicExercises.Encapsulation;

public class Encapsulation {

    public static void main(String[] args) {

        /*
        Упражнения по инкапсуляции Java

        1. Напишите программу на Java для создания класса Person с именем частных переменных экземпляра age и страна.
        Предоставьте общедоступные методы получения и установки для доступа и изменения этих переменных.

        2. Напишите программу на Java для создания класса BankAccount с частными переменными экземпляра
        accountNumber и Balance. Предоставьте общедоступные методы получения и установки для доступа и изменения этих
        переменных.

        3. Напишите программу на Java для создания класса Rectangle с частными переменными экземпляра length и width.
        Предоставьте общедоступные методы получения и установки для доступа и изменения этих переменных.

        4. Напишите программу на Java, чтобы создать класс под названием «Сотрудник» с частными переменными
        экземпляра «сотрудник_id», «имя_сотрудника» и «зарплата_сотрудника». Предоставьте общедоступные методы
        получения и установки для доступа и изменения переменных id и name, но предоставьте метод получения для
        переменной зарплаты, который возвращает форматированную строку.

        5. Напишите программу на Java для создания класса Circle с частной переменной радиуса экземпляра. Предоставьте
        общедоступные методы получения и установки для доступа и изменения переменной радиуса. Однако предоставьте два
        метода, называемые CalculArea() и CalculPerimeter(), которые возвращают рассчитанную площадь и периметр на
        основе текущего значения радиуса.

        6. Напишите программу на Java для создания класса Car с частными переменными экземпляра имя_компании,
        имя_модели, год и пробег. Предоставьте общедоступные методы получения и установки для доступа и изменения
        переменных Company_name, Model_name и Year. Однако предоставьте только метод получения для переменной пробега.

        7. Напишите программу на Java для создания класса Student с частными переменными экземпляра Student_id,
        Student_name и Grades. Предоставьте общедоступные методы получения и установки для доступа и изменения
        переменных Student_id и Student_name. Однако предоставьте метод addGrade(), который позволяет добавлять
        оценку к переменной Grades, одновременно выполняя дополнительную проверку.
         */
    }
}
