package BasicExercises.Encapsulation;

public class Encapsulation5 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java для создания класса Circle с частной переменной радиуса экземпляра. Предоставьте
        общедоступные методы получения и установки для доступа и изменения переменной радиуса. Однако предоставьте два
        метода, называемые CalculArea() и CalculPerimeter(), которые возвращают рассчитанную площадь и периметр на
        основе текущего значения радиуса.
         */

//        Circle circle = new Circle();
//        circle.setRadius(7.0);
//        System.out.println("Circle radius: " + circle.getRadius());
//        circle.calculateArea();
//        circle.calculatePerimeter();
    }
}

//class Circle {
//
//    private double radius;
//
//    public double getRadius() {
//        return radius;
//    }
//
//    public void setRadius(double radius) {
//        this.radius = radius;
//    }
//
//    public void calculateArea() {
//        double a = Math.PI * Math.pow(radius, 2);
//        System.out.println("Area: " + a);
//    }
//
//    public void calculatePerimeter() {
//        double p = 2 * Math.PI * radius;
//        System.out.println("Perimeter: " + p);
//    }
//}