package BasicExercises.Encapsulation;

public class Encapsulation4 {

    public static void main(String[] args) {

        /*
        Напишите программу на Java, чтобы создать класс под названием «Сотрудник» с частными переменными
        экземпляра «сотрудник_id», «имя_сотрудника» и «зарплата_сотрудника». Предоставьте общедоступные методы
        получения и установки для доступа и изменения переменных id и name, но предоставьте метод получения для
        переменной зарплаты, который возвращает форматированную строку.
         */

//        Employee employee = new Employee();
//
//        employee.setEmployee_id(15);
//        employee.setEmployee_name("Evgeniy");
//        employee.setEmployee_salary(50000.0);
//
//        System.out.println("Employee info:");
//        System.out.println("ID: " + employee.getEmployee_id());
//        System.out.println("Name: " + employee.getEmployee_name());
//        System.out.println("Salary: " + employee.getEmployee_salary());
    }
}

//class Employee {
//
//    private int employee_id;
//    private String employee_name;
//    private double employee_salary;
//
//    public int getEmployee_id() {
//        return employee_id;
//    }
//
//    public void setEmployee_id(int employee_id) {
//        this.employee_id = employee_id;
//    }
//
//    public String getEmployee_name() {
//        return employee_name;
//    }
//
//    public void setEmployee_name(String employee_name) {
//        this.employee_name = employee_name;
//    }
//
//    public double getEmployee_salary() {
//        return employee_salary;
//    }
//
//    public void setEmployee_salary(double employee_salary) {
//        this.employee_salary = employee_salary;
//    }
//}