package BasicExercises.Generic;

public class Generic {

    public static void main(String[] args) {

        /*
        Упражнения по универсальному методу Java

        1. Напишите программу на Java для создания универсального метода, который берет два массива одного типа и
        проверяет, содержат ли они одинаковые элементы в одном и том же порядке.

        2. Напишите программу на Java для создания универсального метода, который принимает список чисел и возвращает
        сумму всех четных и нечетных чисел.

        3. Напишите программу на Java для создания универсального метода, принимающего список любого типа и
        целевой элемент. Он возвращает индекс первого вхождения целевого элемента в список. Возвратите -1, если
        целевой элемент не может быть найден.

        4. Напишите программу на Java для создания универсального метода, который принимает список любого типа и
        возвращает его как новый список с элементами в обратном порядке.

        5. Напишите программу на Java для создания универсального метода, который берет два списка одного типа и
        объединяет их в один список. Этот метод чередует элементы каждого списка.

        6. Напишите программу на Java для создания универсального метода, принимающего список любого типа и предикат.
        Он возвращает список массивов, содержащий только те элементы, которые удовлетворяют предикату.

        7. Напишите программу на Java для создания универсального метода, который берет карту любого типа и
        печатает каждую пару ключ-значение.
         */
    }
}
